USE jd;


/*===========================商品总表---exercise=========================*/
/*======================================================================*/

INSERT INTO exercise VALUES(NULL,"头盔"),
                           (NULL,"裤子"),
                           (NULL,"衣服"),
                           (NULL,"鞋子"),
                           (NULL,"登山杖"),
                           (NULL,"包"),
                           (NULL,"安全带"),
                           (NULL,"安全锁"),
                           (NULL,"帽子"),
                           (NULL,"滑雪板"),
                           (NULL,"发带"),
                           (NULL,"手套"),
                           (NULL,"眼镜"),
                           (NULL,"护膝");
                           
 
                           
/*===========================徒步旅行==================================*/
/*======================================================================*/


/*===================衣服表--clothes===============================*/

/*===================徒步旅行 1-4====================*/
INSERT INTO clothes VALUES(NULL,3,"女士MOVE拉链衫","宽松却女性化的曲线设计；令伸展随心所欲；尽情运动欢畅淋漓","女款","徒步旅行",1),
(NULL,3,"女士Generation长款外套","宽松却女性化的曲线设计；令伸展随心所欲；尽情运动欢畅淋漓","女款","徒步旅行",1),
(NULL,3,"男士运动夹克","剪裁舒适；活动无拘无束","男款","徒步旅行",1),
(NULL,3,"男士MOVE拉链衫","剪裁舒适；活动无拘无束；","男款","徒步旅行",1);

/*===================滑雪 5-8====================*/
INSERT INTO clothes VALUES(NULL,3,"花和鸟印花滑雪服","毛领设计，美观保暖。抽绳设计，便于收腰","通用","滑雪",1),
                          (NULL,3,"白色套头夹棉滑雪服","袖口细节，高弹护手材料。下摆细节，侧部拉链，裤身连接卡扣","通用","滑雪",1),
                          (NULL,3,"黑白拼接套头双板滑雪服","立体帽檐，加厚处理立挺不易变形。多兜设计","通用","滑雪",1),
                          (NULL,3,"麻叶军绿色迷彩开身滑雪服","胸前、侧边口袋，便于存放证件","通用","滑雪",1);


/*===================高山跑步 9-12====================*/
INSERT INTO clothes VALUES(NULL,3,"夏季跑步服","超薄透气","男款","高山跑步",1),
                          (NULL,3,"长袖户外跑步套装","休闲百搭的流畅设计","女款","高山跑步",1),
                          (NULL,3,"中袖秋冬服","轻肤柔软，全透气","女款","高山跑步",1),
                          (NULL,3,"休闲男运动服","高档松紧，休闲","男款","高山跑步",1);
                         

/*=====================裤子表--pants========================*/
/*=====================徒步旅行  1-4============================*/

INSERT INTO pants VALUES(NULL,2,"女士运动长裤","剪裁舒适；活动无拘无束；宽松却女性化的曲线设计；令伸展随心所欲；尽情运动欢畅淋漓","女款","徒步旅行",1),
                        (NULL,2,"女士Threadborne Siro长裤","剪裁舒适；活动无拘无束；宽松却女性化的曲线设计；令伸展随心所欲；尽情运动欢畅淋漓","女款","徒步旅行",1),
                        (NULL,2,"男士Swacket长裤","Storm技术具有防泼水、透气的特性","男款","徒步旅行",1),
                        (NULL,2,"男士Center Court Printed短裤","Storm技术具有防泼水、透气的特性","男款","徒步旅行",1),
                        (NULL,2,"女士运动长裤","剪裁舒适；活动无拘无束；宽松却女性化的曲线设计；令伸展随心所欲；尽情运动欢畅淋漓","女款","徒步旅行",1),
                        (NULL,2,"女士Threadborne Siro长裤","剪裁舒适；活动无拘无束；宽松却女性化的曲线设计；令伸展随心所欲；尽情运动欢畅淋漓","女款","徒步旅行",1),
                        (NULL,2,"男士Swacket长裤","Storm技术具有防泼水、透气的特性","男款","徒步旅行",1),
                        (NULL,2,"男士Center Court Printed短裤","Storm技术具有防泼水、透气的特性","男款","徒步旅行",1),
                        (NULL,2,"女士运动长裤","剪裁舒适；活动无拘无束；宽松却女性化的曲线设计；令伸展随心所欲；尽情运动欢畅淋漓","女款","徒步旅行",1),
                        (NULL,2,"女士Threadborne Siro长裤","剪裁舒适；活动无拘无束；宽松却女性化的曲线设计；令伸展随心所欲；尽情运动欢畅淋漓","女款","徒步旅行",1),
                        (NULL,2,"男士Swacket长裤","Storm技术具有防泼水、透气的特性","男款","徒步旅行",1),
                        (NULL,2,"男士Center Court Printed短裤","Storm技术具有防泼水、透气的特性","男款","徒步旅行",1);


/*==================包表--bag===========================*/
/*======================徒步旅行 1-2=======================*/

INSERT INTO bag VALUES(NULL,6,"极道2004621","极道/JackWolfskin大容量登山包42L户外徒步旅行远足包男女士通用多功能野营双肩包2004621","通用","徒步旅行",1),  
                      (NULL,6,"极道NF0A2SA","极道/JackWolfskin大容量登山包42L户外徒步旅行远足包男女士通用多功能野营双肩包2004621","通用","徒步旅行",1);  


/*======================高山跑步--腰包  3-6=======================*/

INSERT INTO bag VALUES(NULL,6,"男女款轻便户外运动跑步腰包","稳定舒适，便捷取用，保温设计","通用","高山跑步",1),  
                      (NULL,6,"男女款跑步腰包","稳定贴合，补给补水，运动便捷","通用","高山跑步",1),
                      (NULL,6,"男士小腰包","多功能防水斜挂腰包","男款","高山跑步",1),  
                      (NULL,6,"隐形小腰包时尚版","透气不闷热，瞬间速干，舒适贴身","通用","高山跑步",1);  
          
/*======================登山--登山包  7-8=======================*/
 
INSERT INTO bag VALUES(NULL,6,"OSPREY","拥有多变的颜色，内衬肩带和一个简易的腰带，让他别具风格，适于让他别具风格，舒适便于承载","通用","登山",1),  
                      (NULL,6,"Topsky","纤维支架与背网组合，坚韧而具有弹性，透气，轻量化","通用","登山",1),
                      (NULL,6,"OSPREY","拥有多变的颜色，内衬肩带和一个简易的腰带，让他别具风格，适于让他别具风格，舒适便于承载","通用","登山",1),  
                      (NULL,6,"Topsky","纤维支架与背网组合，坚韧而具有弹性，透气，轻量化","通用","登山",1),
                      (NULL,6,"OSPREY","拥有多变的颜色，内衬肩带和一个简易的腰带，让他别具风格，适于让他别具风格，舒适便于承载","通用","登山",1);                        
 

/*==================帽子表--hat==================*/  
/*=======================徒步旅行========================*/                  

       
 
 INSERT INTO hat VALUES(NULL,9,"极道NF00A5WG帽","极道TheNorth Face秋冬新品帽子男女款通用舒适保暖双面冬帽NF00A5WG黑色/灰色GAN","通用","徒步旅行",1),
                       (NULL,9,"极道B0087帽","极道 B0087 撞色棒球帽子 男士休闲运动帽春夏户外登山旅游帽","男款","徒步旅行",1),
                       (NULL,9,"极道NF00A5WG帽","极道TheNorth Face秋冬新品帽子男女款通用舒适保暖双面冬帽NF00A5WG黑色/灰色GAN","通用","徒步旅行",1),
                       (NULL,9,"极道B0087帽","极道 B0087 撞色棒球帽子 男士休闲运动帽春夏户外登山旅游帽","男款","徒步旅行",1),
                       (NULL,9,"极道NF00A5WG帽","极道TheNorth Face秋冬新品帽子男女款通用舒适保暖双面冬帽NF00A5WG黑色/灰色GAN","通用","徒步旅行",1),
                       (NULL,9,"极道B0087帽","极道 B0087 撞色棒球帽子 男士休闲运动帽春夏户外登山旅游帽","男款","徒步旅行",1),
                       (NULL,9,"极道NF00A5WG帽","极道TheNorth Face秋冬新品帽子男女款通用舒适保暖双面冬帽NF00A5WG黑色/灰色GAN","通用","徒步旅行",1),
                       (NULL,9,"极道B0087帽","极道 B0087 撞色棒球帽子 男士休闲运动帽春夏户外登山旅游帽","男款","徒步旅行",1),
                       (NULL,9,"极道NF00A5WG帽","极道TheNorth Face秋冬新品帽子男女款通用舒适保暖双面冬帽NF00A5WG黑色/灰色GAN","通用","徒步旅行",1),
                       (NULL,9,"极道B0087帽","极道 B0087 撞色棒球帽子 男士休闲运动帽春夏户外登山旅游帽","男款","徒步旅行",1),
                       (NULL,9,"极道NF00A5WG帽","极道TheNorth Face秋冬新品帽子男女款通用舒适保暖双面冬帽NF00A5WG黑色/灰色GAN","通用","徒步旅行",1); 
 

/*==================头盔表--helmet==================*/  
/*======滑雪 1-2========*/ 
INSERT INTO helmet VALUES(NULL,1,"山脉滑雪Raider滑雪头盔","具有耐久的外壳结构，持久的耐用性和强度","通用","滑雪",1),
                         (NULL,1,"全地形系列p1us2.0单双板滑雪盔","手调可闭合通风系统，自然听力系统","通用","滑雪",1);
                         

/*======攀岩 3-4=======*/ 
INSERT INTO helmet VALUES(NULL,1,"防护头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"攀岩头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"防护头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"攀岩头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"防护头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"攀岩头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"防护头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"攀岩头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"防护头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1),
			 (NULL,1,"攀岩头盔","登山 攀岩 消防救援 拓展 速降","通用","攀岩",1);
 
 
/*==================眼镜表--glasses==================*/  
/*======滑雪 1-2=======*/
 INSERT INTO glasses VALUES(NULL,13,"双层柱面滑雪镜","防紫外线抗冲击","通用","滑雪",1),
                           (NULL,13,"双层球面滑雪镜","防紫外线抗冲击","通用","滑雪",1);
 
 /*=====登山 3-4========*/
  INSERT INTO glasses VALUES(NULL,13,"登山眼镜","spx材质，防滑系统，快速离合铰链位，双调校鼻托中梁设计，LST镜片","男款","登山",1),
                            (NULL,13,"登山护目眼镜","表层防刮强化膜，强化偏光镜，PVA偏过滤膜，底层抗压强化保护膜","女款","登山",1),
                            (NULL,13,"登山眼镜","spx材质，防滑系统，快速离合铰链位，双调校鼻托中梁设计，LST镜片","男款","登山",1),
                            (NULL,13,"登山护目眼镜","表层防刮强化膜，强化偏光镜，PVA偏过滤膜，底层抗压强化保护膜","女款","登山",1),
                            (NULL,13,"登山眼镜","spx材质，防滑系统，快速离合铰链位，双调校鼻托中梁设计，LST镜片","男款","登山",1),
                            (NULL,13,"登山护目眼镜","表层防刮强化膜，强化偏光镜，PVA偏过滤膜，底层抗压强化保护膜","女款","登山",1),
                            (NULL,13,"登山眼镜","spx材质，防滑系统，快速离合铰链位，双调校鼻托中梁设计，LST镜片","男款","登山",1),
                            (NULL,13,"登山护目眼镜","表层防刮强化膜，强化偏光镜，PVA偏过滤膜，底层抗压强化保护膜","女款","登山",1),
                            (NULL,13,"登山眼镜","spx材质，防滑系统，快速离合铰链位，双调校鼻托中梁设计，LST镜片","男款","登山",1),
                            (NULL,13,"登山护目眼镜","表层防刮强化膜，强化偏光镜，PVA偏过滤膜，底层抗压强化保护膜","女款","登山",1);
 
 
 /*==================手套表--glove===========================*/  
 
 /*=====滑雪 1-4=====*/
 INSERT INTO glove VALUES(NULL,12,"专业竞技滑雪手套","提供高水平保护、舒适性和抓地力","男","滑雪",1),
                         (NULL,12,"滑雪皮质手套","全真皮设计，手背防护设计","通用","滑雪",1),
                         (NULL,12,"户外运动女款滑雪手套 ","每个手指都采用弧度设计，指尖增加防护耐磨层，防滑减震，让手指免受外力压迫","女","滑雪",1),
                         (NULL,12,"滑雪手套 PROPELLER DRY","方便抓握，手感良好,采用AdvancedSkin Dry 防水面料和修身袖口设计","男","滑雪",1);
 
 /*=======登山=========*/
 INSERT INTO glove VALUES(NULL,12,"登山运动手套","轻如羽毛，无束缚感，随意折","通用","登山",1),
                         (NULL,12,"安德玛登山手套","可调节腕部扣带 排潮透气","男","登山",1),
                         (NULL,12,"登山运动手套","轻如羽毛，无束缚感，随意折","通用","登山",1),
                         (NULL,12,"安德玛登山手套","可调节腕部扣带 排潮透气","男","登山",1),
                         (NULL,12,"登山运动手套","轻如羽毛，无束缚感，随意折","通用","登山",1),
                         (NULL,12,"安德玛登山手套","可调节腕部扣带 排潮透气","男","登山",1),
                         (NULL,12,"登山运动手套","轻如羽毛，无束缚感，随意折","通用","登山",1),
                         (NULL,12,"安德玛登山手套","可调节腕部扣带 排潮透气","男","登山",1);
 
 
 
 
/*==================鞋子表--shoes===========================*/  
/*====滑雪1-6=====*/
 INSERT INTO shoes VALUES(NULL,4,"F1","F1具有响应性，侧向刚性设计和令人难以置信的运动范围，以及采用集成RECCO技术的更新衬里结构","通用","对称","MD","MD","MD","滑雪","566","透气",1),
                         (NULL,4,"Maestrale","具有更新的功能，使其成为更好的全能表演者。对于那些寻找滑雪板以及滑雪板的单人靴子的人来说，Maestrale继续提供","通用","对称","MD","SD","CD","滑雪","566","透气",1),
                         (NULL,4,"FREEDOM SL 120","同时保持轻便和灵活，足以在大型车上执行任务穷国的目标","通用","对称","MD","SD","CD","滑雪","566","透气",1),
                         (NULL,4,"TX PRO WOMEN'S","可以在全天巡演，深度假期和陡峭的技术路线上使用","女","对称","MD","SD","CD","滑雪","566","透气",1),
                         (NULL,4,"TX COMP","TX Comp是适用于大线和陡峭地形的终极硬充电自由靴。","男","对称","MD","SD","CD","滑雪","566","透气",1),
                         (NULL,4,"GEA RS","女性专用AT靴子提升了自由滑行性能和野外功能的交叉","女","对称","MD","MD","MD","滑雪","566","透气",1);
 
 /*=====攀岩7-9======*/
  INSERT INTO shoes VALUES(NULL,4,"STICKIT","抓地","通用","对称","RS沾性橡胶","FRIXION","皮革","攀岩","422","透气",1),
                         (NULL,4,"攀岩鞋","耐磨","通用","对称","耐久沾性橡胶","FRIXION","无缝线皮面","攀岩","422","透气",1),
                         (NULL,4,"Kailas/凯乐石","透气","通用","对称","橡胶片、牛绒皮革","耐磨尼龙","耐磨皮革","攀岩","422","透气",1);
 
 
 /*======登山10-11========*/
 
 INSERT INTO shoes VALUES(NULL,4,"THE NORTH FACE","舒适透气鞋面 抓地耐磨外底","男","对称","聚氨酯鞋垫","高弹性减震","vibram 橡胶","登山","422","透气",1),
                         (NULL,4,"Kailas","防水防滑 干湿地通用 V底","男","对称","聚氨酯鞋垫","高弹性减震","vibram 橡胶","登山","422","透气",1),
                         (NULL,4,"Kailas","防水防滑 干湿地通用 V底","男","对称","聚氨酯鞋垫","高弹性减震","vibram 橡胶","登山","422","透气",1);
 
/*==================滑雪板表--ski===========================*/   
/*=====滑雪=====*/
INSERT INTO ski VALUES(NULL,10,"单板滑雪男子Ripcord单板","玻璃纤维，挤压成型板底","男","滑雪",1),
		      (NULL,10,"单板滑雪涂鸦单板","复合可再生的白杨木及桦木的优化排列组合","通用","滑雪",1),
                      (NULL,10,"全地形自由滑行单板","随板型宽度曲线变化，让你能够适应更多样的雪道","通用","滑雪",1),
                      (NULL,10,"单板滑雪男子DESCENDANT艺术家合作款 ","滑槽设计，边刃防护设计","通用","滑雪",1),
                      (NULL,10,"男子滑雪板双板 高端野雪板 ","全侧壁，轻量化木质板芯","男","滑雪",1),
                      (NULL,10,"男子滑雪板双板 全地形板","自身重量更轻，更强结构与碳编织网","男","滑雪",1),
                      (NULL,10,"女子滑雪板双板 雪道竞技板","轻巧的滑雪板，稳定和易操控","女","滑雪",1),
                      (NULL,10,"全地形自由滑行单板","随板型宽度曲线变化，让你能够适应更多样的雪道","通用","滑雪",1),
                      (NULL,10,"单板滑雪男子DESCENDANT艺术家合作款 ","滑槽设计，边刃防护设计","通用","滑雪",1),
                      (NULL,10,"男子滑雪板双板 高端野雪板 ","全侧壁，轻量化木质板芯","男","滑雪",1),
                      (NULL,10,"男子滑雪板双板 全地形板","自身重量更轻，更强结构与碳编织网","男","滑雪",1),
                      (NULL,10,"女子滑雪板双板 雪道竞技板","轻巧的滑雪板，稳定和易操控","女","滑雪",1);

 
/*==================发带表--hairBelt==================*/ 
INSERT INTO hairbelt VALUES(NULL,11,"新款运动发带","简约甜美深林系","女","高山跑步",1),
                           (NULL,11,"新款男发带","日韩风格","男","高山跑步",1),
                           (NULL,11,"民族风时尚女头箍","时尚百搭","女","高山跑步",1),
                           (NULL,11,"印花防滑运动发带","透气，轻薄，舒适","女","高山跑步",1),
                           (NULL,11,"男女运动字母发带","简约系，舒适","男","高山跑步",1),
                           (NULL,11,"户外吸汗发带","简约时尚","女","高山跑步",1),
                           (NULL,11,"新款运动发带","简约甜美深林系","女","高山跑步",1),
                           (NULL,11,"新款男发带","日韩风格","男","高山跑步",1),
                           (NULL,11,"民族风时尚女头箍","时尚百搭","女","高山跑步",1),
                           (NULL,11,"印花防滑运动发带","透气，轻薄，舒适","女","高山跑步",1),
                           (NULL,11,"男女运动字母发带","简约系，舒适","男","高山跑步",1),
                           (NULL,11,"户外吸汗发带","简约时尚","女","高山跑步",1);



/*==================登山杖表--alpenstock==================*/
INSERT INTO alpenstock VALUES(NULL,5,"骆驼户外登山杖","弹簧避震系统，膨胀锁紧装置，可拆卸雪托，人体工程手柄，精准科学刻度","通用","登山",1),
                             (NULL,5,"丛林豹 户外正品登山杖","塑料手柄，手感舒适；强度高弹簧，有效缓减冲击；合金杖尖，更耐磨","男","登山",1),
                             (NULL,5,"骆驼户外登山杖","弹簧避震系统，膨胀锁紧装置，可拆卸雪托，人体工程手柄，精准科学刻度","通用","登山",1),
                             (NULL,5,"丛林豹 户外正品登山杖","塑料手柄，手感舒适；强度高弹簧，有效缓减冲击；合金杖尖，更耐磨","男","登山",1),
                             (NULL,5,"骆驼户外登山杖","弹簧避震系统，膨胀锁紧装置，可拆卸雪托，人体工程手柄，精准科学刻度","通用","登山",1),
                             (NULL,5,"丛林豹 户外正品登山杖","塑料手柄，手感舒适；强度高弹簧，有效缓减冲击；合金杖尖，更耐磨","男","登山",1),
                             (NULL,5,"骆驼户外登山杖","弹簧避震系统，膨胀锁紧装置，可拆卸雪托，人体工程手柄，精准科学刻度","通用","登山",1),
                             (NULL,5,"丛林豹 户外正品登山杖","塑料手柄，手感舒适；强度高弹簧，有效缓减冲击；合金杖尖，更耐磨","男","登山",1),
                             (NULL,5,"骆驼户外登山杖","弹簧避震系统，膨胀锁紧装置，可拆卸雪托，人体工程手柄，精准科学刻度","通用","登山",1),
                             (NULL,5,"丛林豹 户外正品登山杖","塑料手柄，手感舒适；强度高弹簧，有效缓减冲击；合金杖尖，更耐磨","男","登山",1),
                             (NULL,5,"骆驼户外登山杖","弹簧避震系统，膨胀锁紧装置，可拆卸雪托，人体工程手柄，精准科学刻度","通用","登山",1),
                             (NULL,5,"丛林豹 户外正品登山杖","塑料手柄，手感舒适；强度高弹簧，有效缓减冲击；合金杖尖，更耐磨","男","登山",1);
                                
 
/*===========================安全带--

belt======================================*/ 
INSERT INTO belt VALUES(NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1),
                       (NULL,7,"可调节式攀岩带","洞穴探险、攀岩、登山、溪降","攀岩",1);
 

/*===========================安全锁--

safelock======================================*/ 
INSERT INTO safelock VALUES(NULL,8,"D型丝扣主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型主动主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型丝扣主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型主动主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型丝扣主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型主动主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型丝扣主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型主动主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型丝扣主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型主动主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型丝扣主锁","用于攀岩、救援、速降、高空作业","攀岩",1),
                           (NULL,8,"D型主动主锁","用于攀岩、救援、速降、高空作业","攀岩",1);
 
 
 
 
/*===========================绳子--

kneepad======================================*/ 
INSERT INTO kneepad VALUES(NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1),
                          (NULL,14,"9芯伞绳","露营 登山 攀岩 救援","通用","攀岩",1);
                          
                          
                          
                          
/*===============商品材质价格表--goodsmp--衣服=========================*/
/*===徒步旅行===*/
INSERT INTO goodsmp VALUES(3,1,"徒步旅行","聚酯纤维",529.00,329.00),
                          (3,2,"徒步旅行","聚酯纤维",699.00,499.00),
                          (3,3,"徒步旅行","聚酯纤维",928.00,728.00),
                          (3,4,"徒步旅行","聚酯纤维",329.00,129.00);
                          
/*====滑雪=====*/
INSERT INTO goodsmp VALUES(3,5,"滑雪","晴纶棉",899.00,699.00),
                          (3,6,"滑雪","晴纶棉",799.00,599.00),
                          (3,7,"滑雪","晴纶棉",628.00,428.00),
                          (3,8,"滑雪","晴纶棉",1299.00,1099.00);
                          
/*====高山跑步====*/
INSERT INTO goodsmp VALUES(3,9,"高山跑步","棉麻",345.00,145.00),
                          (3,10,"高山跑步","牛津纺纶",609.00,409.00),
                          (3,11,"高山跑步","弹性面料",548.00,348.00),
                          (3,12,"高山跑步","高聚酯纤",356.00,156.00);
                       
/*===============================头盔=============================*/
/*======攀岩======*/
INSERT INTO goodsmp VALUES(1,1,"攀岩","聚碳酸酯发泡聚丙烯",200.00,100.00),
                          (1,2,"攀岩","ABS+PCEPS",215.00,115.00);
                          
                          
/*======滑雪=======*/  
INSERT INTO goodsmp VALUES(1,3,"滑雪","Abs",238.00,138.00),
                          (1,4,"滑雪","pc",523.00,423.00);                   

              

                 

/*===============================旅行包============================*/        

          
/*====徒步旅行====*/
  
  INSERT INTO goodsmp VALUES(6,1,"徒步旅行","轻便耐磨抗撕扯面料",699.00,499.00),
                            (6,2,"徒步旅行","轻便耐磨抗撕扯面料",1024.00,824.00);
                            

 /*===高山跑步====*/
  
  INSERT INTO goodsmp VALUES(6,3,"高山跑步","弹性针织面料",754.00,554.00),
                            (6,4,"高山跑步","弹性针织面料",457.00,257.00),
                            (6,5,"高山跑步","牛津纺",243.00,143.00),
                            (6,6,"高山跑步","锦纶",172.00,72.00);
                            
                                                   
 /*=====登山===*/
  
  INSERT INTO goodsmp VALUES(6,7,"登山","其他", 479.00,279.00),
                            (6,8,"登山","锦纶",178.00,78.00);   
                            
 /*=====================================帽子===========================*/  
                   
 /*=====徒步旅行====*/   
 
 INSERT INTO goodsmp VALUES(9,1,"徒步旅行","PRIMALOFT羊毛混",298.00,198.00),
                           (9,1,"徒步旅行","纺面料",158.00,58.00),
                           (9,2,"徒步旅行","棉",109.00,59.00);               

       

                           
 /*=====================================眼镜===========================*/  
                   
 /*=====滑雪====*/   
 
 INSERT INTO goodsmp VALUES(13,1,"滑雪","聚碳酸酯",568.00,368.00),
                           (13,2,"滑雪","聚碳酸酯",699.00,499.00);           

           

 /*=====登山====*/   
 
 INSERT INTO goodsmp VALUES(13,3,"登山","SPX",698.00,498.00),
                           (13,4,"登山","SPX",800.00,600.00);                

      

/*=====================================手套===========================*/ 
/*=======滑雪=====*/
 INSERT INTO goodsmp VALUES(12,1,"滑雪","山羊皮",468.00,268.00),
                           (12,2,"滑雪","凯夫拉真皮",298.00,198.00),
                           (12,3,"滑雪","AdvancedSkin Dry",398.00,198.00),
                           (12,4,"滑雪","3M新雪丽暖绒",298.00,198.00); 

/*=======登山=====*/
 INSERT INTO goodsmp VALUES(12,5,"登山","羊毛",198.00,98.00),
                           (12,6,"登山","羊毛",229.00,129.00); 


/*=====================================鞋子===========================*/ 
/*=======滑雪 1-6=====*/
 INSERT INTO goodsmp VALUES(4,1,"滑雪","SUO",1788.00,1388.00),
                           (4,2,"滑雪","SUO",1998.00,1498.00),
                           (4,3,"滑雪","SUO",1578.00,1078.00),
                           (4,4,"滑雪","SUO",1568.00,1068.00),
                           (4,5,"滑雪","SUO",2398.00,1598.00),
                           (4,6,"滑雪","SUO",2099.00,1599.00); 

/*=======攀岩 7-9=====*/
 INSERT INTO goodsmp VALUES(4,7,"攀岩","皮革",499.00,299.00),
                           (4,8,"攀岩","橡胶、皮革",350.00,200.00),
                           (4,9,"攀岩","橡胶片、牛绒皮革",420.00,220.00); 


/*=======登山 10-11=====*/
 INSERT INTO goodsmp VALUES(4,10,"登山","织物",768.00,568.00),
                           (4,11,"登山","网布",1099.00,799.00); 



/*=====================================滑雪板===========================*/
 INSERT INTO goodsmp VALUES(10,1,"滑雪","SUV",2399.00,1899.00),
                           (10,2,"滑雪","REI",2199.00,1699.00),
                           (10,3,"滑雪","DAS",2788.00,2288.00),
                           (10,4,"滑雪","RWQ",3199.00,2599.00),
                           (10,5,"滑雪","QWE",5688.00,5088.00),
                           (10,6,"滑雪","DAS",4788.00,4088.00),
                           (10,7,"滑雪","OEU",3698.00,3098.00); 


/*================================发带

======================================*/



INSERT INTO goodsmp VALUES(11,1,"高山跑步","韩国布艺",54.00,34.00),
                           (11,2,"高山跑步","棉麻",34.00,14.00),
                           (11,3,"高山跑步","布",64.00,34.00),
                           (11,4,"高山跑步","聚酯纤维",48.00,24.00),
                           (11,5,"高山跑步","聚酯轮",39.00,19.00),
                           (11,6,"高山跑步","弹性面料",52.00,22.00);


/*=============================登山杖

==========================================*/
INSERT INTO goodsmp VALUES(5,1,"登山","铝合金",68.00,34.00),
                          (5,2,"登山","铝合金",68.00,34.00);


/*=============================安全带

==========================================*/
INSERT INTO goodsmp VALUES(7,1,"攀岩","聚酯纤维 铝",300.00,150.00);

/*==============================绳子

==========================================*/
INSERT INTO goodsmp VALUES(14,1,"攀岩","丙纶纤维",300.00,150.00);




/*=============================产品颜色、尺寸、库存表

=====================================*/
/*
goodsKindId          INT NOT NULL,
goodsId              INT NOT NULL,
exerciseName         VARCHAR(10) NOT NULL,
color                VARCHAR(10) NOT NULL,
size                 VARCHAR(10) NOT NULL, 
num                  INT NOT NULL,
*/


INSERT INTO goodsstock VALUES(1,1,"滑雪","白色","M",20),
                             (1,1,"滑雪","白色","L",10),
                             (1,2,"滑雪","黑色","M",22),
                             (1,2,"滑雪","黑色","L",8),
                             (1,3,"攀岩","黄色","M",2),
                             (1,3,"攀岩","蓝色","M",10),
                             (1,3,"攀岩","粉色","M",37),
                             (1,3,"攀岩","红色","M",20),
                             (1,3,"攀岩","黑色","M",18),
                             (1,3,"攀岩","黄色","L",39),
                             (1,3,"攀岩","蓝色","L",20),
                             (1,3,"攀岩","粉色","L",0),
                             (1,3,"攀岩","红色","L",0),
                             (1,3,"攀岩","黑色","L",12),
                             (1,4,"攀岩","蓝色","M",2),
                             (1,4,"攀岩","白色","M",10),
                             (1,4,"攀岩","红色","M",37),
                             (1,4,"攀岩","粉色","M",20),
                             (1,4,"攀岩","桔色","M",18),
                             (1,4,"攀岩","黑色","M",39),
                             (1,4,"攀岩","蓝色","L",2),
                             (1,4,"攀岩","白色","L",10),
                             (1,4,"攀岩","红色","L",37),
                             (1,4,"攀岩","粉色","L",20),
                             (1,4,"攀岩","桔色","L",18),
                             (1,4,"攀岩","黑色","L",39),
			     (2,1,"徒步旅行","黑色","XS",23),
			     (2,1,"徒步旅行","黑色","S",12),
			     (2,1,"徒步旅行","黑色","M",32),
		             (2,1,"徒步旅行","黑色","L",10),
		             (2,1,"徒步旅行","黑色","XL",0),
		             (2,1,"徒步旅行","粉色","XS",45),
			     (2,1,"徒步旅行","粉色","S",43),
			     (2,1,"徒步旅行","粉色","M",12),
		             (2,1,"徒步旅行","粉色","L",34),
		             (2,1,"徒步旅行","粉色","XL",8),
		             (2,2,"徒步旅行","黑色","XS",23),
			     (2,2,"徒步旅行","黑色","S",12),
			     (2,2,"徒步旅行","黑色","M",32),
		             (2,2,"徒步旅行","黑色","L",10),
		             (2,2,"徒步旅行","黑色","XL",0),
		             (2,2,"徒步旅行","烟灰色","XS",45),
			     (2,2,"徒步旅行","烟灰色","S",43),
			     (2,2,"徒步旅行","烟灰色","M",12),
		             (2,2,"徒步旅行","烟灰色","L",34),
		             (2,2,"徒步旅行","烟灰色","XL",8),
			     (2,3,"徒步旅行","黑色","S",12),
			     (2,3,"徒步旅行","黑色","M",32),
		             (2,3,"徒步旅行","黑色","L",10),
		             (2,3,"徒步旅行","黑色","XL",0),
                             (2,3,"徒步旅行","黑色","XXL",23),
			     (2,3,"徒步旅行","钢色","S",43),
			     (2,3,"徒步旅行","钢色","M",12),
		             (2,3,"徒步旅行","钢色","L",34),
		             (2,3,"徒步旅行","钢色","XL",8),
		             (2,3,"徒步旅行","钢色","XXL",45),
		             (2,3,"徒步旅行","巴塞尔蓝","S",43),
			     (2,3,"徒步旅行","巴塞尔蓝","M",12),
		             (2,3,"徒步旅行","巴塞尔蓝","L",34),
		             (2,3,"徒步旅行","巴塞尔蓝","XL",8),
		             (2,3,"徒步旅行","巴塞尔蓝","XXL",45),
		             (2,3,"徒步旅行","黑色","S",12),
			     (2,3,"徒步旅行","黑色","M",32),
		             (2,3,"徒步旅行","黑色","L",10),
		             (2,3,"徒步旅行","黑色","XL",0),
		             (2,3,"徒步旅行","黑色","XXL",23),
			     (2,3,"徒步旅行","白色","S",43),
			     (2,3,"徒步旅行","白色","M",12),
		             (2,3,"徒步旅行","白色","L",34),
		             (2,3,"徒步旅行","白色","XL",8),
		             (2,3,"徒步旅行","白色","XXL",45),
		             (2,3,"徒步旅行","深栗色","S",43),
			     (2,3,"徒步旅行","深栗色","M",12),
		             (2,3,"徒步旅行","深栗色","L",34),
		             (2,3,"徒步旅行","深栗色","XL",8),
		             (2,3,"徒步旅行","深栗色","XXL",45),
		             (3,1,"徒步旅行","白色","s",12),
		             (3,1,"徒步旅行","白色","M",10),
		             (3,1,"徒步旅行","黑色","s",12),
		             (3,1,"徒步旅行","黑色","M",10),
		             (3,1,"徒步旅行","无线电红","s",12),
		             (3,1,"徒步旅行","无线电红","M",10),
		             (3,2,"徒步旅行","幽灵灰","XS",12),
		             (3,2,"徒步旅行","幽灵灰","S",0),
		             (3,2,"徒步旅行","幽灵灰","M",0),
		             (3,2,"徒步旅行","幽灵灰","L",10),
		             (3,2,"徒步旅行","幽灵灰","XL",12),
		             (3,2,"徒步旅行","黑色","XS",12),
		             (3,2,"徒步旅行","黑色","S",8),
		             (3,2,"徒步旅行","黑色","M",12),
		             (3,2,"徒步旅行","黑色","L",10),
		             (3,2,"徒步旅行","黑色","XL",12),
		             (3,3,"徒步旅行","钢色","S",23),
		             (3,3,"徒步旅行","钢色","M",0),
		             (3,3,"徒步旅行","钢色","L",10),
		             (3,3,"徒步旅行","钢色","XL",12),
		             (3,3,"徒步旅行","钢色","XLL",12),
		             (3,3,"徒步旅行","黑色","S",12),
		             (3,3,"徒步旅行","黑色","M",12),
		             (3,3,"徒步旅行","黑色","L",10),/*100*/
                             (3,3,"徒步旅行","黑色","XL",12),
		             (3,3,"徒步旅行","黑色","XLL",8),
		             (3,3,"徒步旅行","白色","S",45),
		             (3,3,"徒步旅行","白色","M",12),
		             (3,3,"徒步旅行","白色","L",34),
		             (3,3,"徒步旅行","白色","XL",12),
		             (3,3,"徒步旅行","白色","XLL",8),
		             (3,4,"徒步旅行","白色","S",23),
		             (3,4,"徒步旅行","白色","M",0),
		             (3,4,"徒步旅行","白色","L",10),
		             (3,4,"徒步旅行","白色","XL",12),
		             (3,4,"徒步旅行","白色","XLL",12),
		             (3,4,"徒步旅行","黑色","S",12),
		             (3,4,"徒步旅行","黑色","M",12),
		             (3,4,"徒步旅行","黑色","L",10),
		             (3,4,"徒步旅行","黑色","XL",12),
		             (3,4,"徒步旅行","黑色","XLL",8),
		             (3,4,"徒步旅行","深栗色","S",45),
		             (3,4,"徒步旅行","深栗色","M",12),
		             (3,4,"徒步旅行","深栗色","L",34),
		             (3,4,"徒步旅行","深栗色","XL",12),
		             (3,4,"徒步旅行","深栗色","XLL",8),
		             (3,5,"滑雪","黑色","S",23),
		             (3,5,"滑雪","黑色","M",11),
		             (3,5,"滑雪","黑色","L",10),
		             (3,5,"滑雪","黑色","XL",12),
		             (3,5,"滑雪","黑色","XLL",12),
		             (3,6,"滑雪","白色","S",12),
		             (3,6,"滑雪","白色","M",12),
		             (3,6,"滑雪","白色","L",10),
		             (3,6,"滑雪","白色","XL",12),
		             (3,6,"滑雪","白色","XLL",8),
		             (3,7,"滑雪","黑白拼接","S",45),
		             (3,7,"滑雪","黑白拼接","M",12),
		             (3,7,"滑雪","黑白拼接","L",34),
		             (3,7,"滑雪","黑白拼接","XL",12),
		             (3,7,"滑雪","黑白拼接","XLL",8),
		             (3,8,"滑雪","迷彩","S",23),
		             (3,8,"滑雪","迷彩","M",12),
		             (3,8,"滑雪","迷彩","L",10),
		             (3,8,"滑雪","迷彩","XL",12),
		             (3,8,"滑雪","迷彩","XLL",12),
		             (3,9,"高山跑步","红色","S",12),
		             (3,9,"高山跑步","红色","M",12),
		             (3,9,"高山跑步","红色","L",10),
		             (3,9,"高山跑步","红色","XL",12),
		             (3,9,"高山跑步","红色","XLL",8),
		             (3,10,"高山跑步","黑色","S",45),
		             (3,10,"高山跑步","黑色","M",12),
		             (3,10,"高山跑步","黑色","L",34),
		             (3,11,"高山跑步","灰色","S",23),
		             (3,11,"高山跑步","灰色","M",0),
		             (3,11,"高山跑步","灰色","L",10),
		             (3,11,"高山跑步","灰色","XL",12),
		             (3,11,"高山跑步","灰色","XLL",12),
		             (3,12,"高山跑步","白色","S",12),
		             (3,12,"高山跑步","白色","M",12),
		             (3,12,"高山跑步","白色","L",10),
		             (3,12,"高山跑步","白色","XL",12),
		             (3,12,"高山跑步","白色","XLL",8),
		             (4,1,"滑雪","黑橘色","37",12),
		             (4,1,"滑雪","黑橘色","38",10),
		             (4,1,"滑雪","黑橘色","39",0),
		             (4,1,"滑雪","黑橘色","40",10),
		             (4,1,"滑雪","黑橘色","41",12),
		             (4,1,"滑雪","黑橘色","42",23),
		             (4,2,"滑雪","蓝色","37",12),
		             (4,2,"滑雪","蓝色","38",10),
		             (4,2,"滑雪","蓝色","39",0),
		             (4,2,"滑雪","蓝色","40",10),
		             (4,2,"滑雪","蓝色","41",12),
		             (4,2,"滑雪","蓝色","42",23),
		             (4,3,"滑雪","黑绿色","37",12),
		             (4,3,"滑雪","黑绿色","38",10),
		             (4,3,"滑雪","黑绿色","39",0),
		             (4,3,"滑雪","黑绿色","40",10),
		             (4,3,"滑雪","黑绿色","41",12),
		             (4,3,"滑雪","黑绿色","42",23),
		             (4,4,"滑雪","绿色","37",12),
		             (4,4,"滑雪","绿色","38",10),
		             (4,4,"滑雪","绿色","39",0),
		             (4,4,"滑雪","绿色","40",10),
		             (4,4,"滑雪","绿色","41",12),
		             (4,4,"滑雪","绿色","42",23),
		             (4,5,"滑雪","红色","37",12),
		             (4,5,"滑雪","红色","38",10),
		             (4,5,"滑雪","红色","39",0),
		             (4,5,"滑雪","红色","40",10),
		             (4,5,"滑雪","红色","41",12),
		             (4,5,"滑雪","红色","42",23),
		             (4,6,"滑雪","深灰色","37",12),
		             (4,6,"滑雪","深灰色","38",10),
		             (4,6,"滑雪","深灰色","39",0),
		             (4,6,"滑雪","深灰色","40",10),
		             (4,6,"滑雪","深灰色","41",12),
		             (4,6,"滑雪","深灰色","42",23),
		             (4,7,"攀岩","黑橘色","37",12),
		             (4,7,"攀岩","黑橘色","38",10),
		             (4,7,"攀岩","黑橘色","39",0),
		             (4,7,"攀岩","黑橘色","40",10),/*100*/
			     (4,7,"攀岩","黑橘色","41",12),
		             (4,7,"攀岩","黑橘色","42",23),
		             (4,8,"攀岩","蓝色","37",12),
		             (4,8,"攀岩","蓝色","38",10),
		             (4,8,"攀岩","蓝色","39",0),
		             (4,8,"攀岩","蓝色","40",10),
		             (4,8,"攀岩","蓝色","41",12),
		             (4,8,"攀岩","蓝色","42",23),
		             (4,9,"攀岩","黑绿色","37",12),
		             (4,9,"攀岩","黑绿色","38",10),
		             (4,9,"攀岩","黑绿色","39",0),
		             (4,9,"攀岩","黑绿色","40",10),
		             (4,9,"攀岩","黑绿色","41",12),
		             (4,9,"攀岩","黑绿色","42",23),
		             (4,10,"登山","黑橘色","37",12),
		             (4,10,"登山","黑橘色","38",10),
		             (4,10,"登山","黑橘色","39",0),
		             (4,10,"登山","黑橘色","40",10),
		             (4,10,"登山","黑橘色","41",12),
		             (4,10,"登山","黑橘色","42",23),
		             (4,11,"登山","蓝色","37",12),
		             (4,11,"登山","蓝色","38",10),
		             (4,11,"登山","蓝色","39",0),
		             (4,11,"登山","蓝色","40",10),
		             (4,11,"登山","蓝色","41",2),
		             (4,11,"登山","蓝色","42",23),
		             (5,1,"登山","黄色","60.0",12),
		             (5,1,"登山","黄色","80.0",15),
		             (5,1,"登山","黄色","100.0",2),
		             (5,1,"登山","黑色","60.0",32),
		             (5,1,"登山","黑色","80.0",5),
		             (5,1,"登山","黑色","100.0",2),
		             (5,1,"登山","黄色","60.0",25),
		             (5,1,"登山","黄色","80.0",15),
		             (5,1,"登山","黄色","100.0",17),
		             (5,2,"登山","黄色","60.0",12),
		             (5,2,"登山","黄色","80.0",29),
		             (5,2,"登山","黄色","100.0",2),
		             (5,2,"登山","黑色","60.0",23),
		             (5,2,"登山","黑色","80.0",15),
		             (5,2,"登山","黑色","100.0",2),
		             (5,2,"登山","黄色","60.0",25),
		             (5,2,"登山","黄色","80.0",25),
		             (5,2,"登山","黄色","100.0",7),
		             (6,1,"徒步旅行","钢色","730*320*320mm",24),
		             (6,2,"徒步旅行","深灰色","490*300*160mm",14),
		             (6,3,"徒步旅行","黑色","490*300*160mm",12),
		             (6,4,"高山跑步","蓝色","490*300*160mm",9),
		             (6,5,"高山跑步","灰色","730*320*320mm",0),
		             (6,6,"高山跑步","红色","730*320*320mm",45),
		             (6,7,"高山跑步","橘色","730*320*320mm",31),
		             (6,7,"登山","紫色","730*320*320mm",11),
		             (6,7,"登山","青蓝色","730*320*320mm",17),
		             (6,8,"登山","蓝色","490*300*160mm",33),
		             (6,8,"登山","红色","490*300*160mm",28),
		             (7,1,"攀岩","蓝色","均码",32),
		             (7,1,"攀岩","橘色","均码",43),
		             (7,1,"攀岩","绿色","均码",39),
		             (7,1,"攀岩","黑色","均码",39),
		             (8,1,"攀岩","银色","均码",56),
		             (8,2,"攀岩","银色","均码",49),
		             (9,1,"徒步旅行","黑色","均码",46),
		             (9,1,"徒步旅行","灰色","均码",59),
		             (9,2,"徒步旅行","黑色","均码",73),
		             (9,2,"徒步旅行","藏青","均码",81),
		             (10,1,"滑雪","黑色","148cm",78),
		             (10,1,"滑雪","蓝色","148cm",25),
		             (10,1,"滑雪","红色","148cm",67),
		             (10,1,"滑雪","黄青","148cm",39),
		             (10,1,"滑雪","黑色","152cm",18),
		             (10,1,"滑雪","蓝色","152cm",25),
		             (10,1,"滑雪","红色","152cm",67),
		             (10,1,"滑雪","黄青","152cm",30),
		             (10,1,"滑雪","黑色","157cm",19),
		             (10,1,"滑雪","蓝色","157cm",34),
		             (10,1,"滑雪","红色","157cm",60),
		             (10,1,"滑雪","黄青","157cm",49),
		             (10,2,"滑雪","黑色","148cm",78),
		             (10,2,"滑雪","蓝色","148cm",25),
		             (10,2,"滑雪","红色","148cm",67),
		             (10,2,"滑雪","黄青","148cm",39),
		             (10,2,"滑雪","黑色","152cm",18),
		             (10,2,"滑雪","蓝色","152cm",25),
		             (10,2,"滑雪","红色","152cm",67),
		             (10,2,"滑雪","黄青","152cm",30),
		             (10,2,"滑雪","黑色","157cm",19),
		             (10,2,"滑雪","蓝色","157cm",34),
		             (10,2,"滑雪","红色","157cm",60),
		             (10,2,"滑雪","黄青","157cm",49),
		             (10,3,"滑雪","黑色","148cm",78),
		             (10,3,"滑雪","蓝色","148cm",25),
		             (10,3,"滑雪","红色","148cm",67),
		             (10,3,"滑雪","黄青","148cm",39),
		             (10,3,"滑雪","黑色","152cm",18),
		             (10,3,"滑雪","蓝色","152cm",25),
		             (10,3,"滑雪","红色","152cm",67),
		             (10,3,"滑雪","黄青","152cm",30),
		             (10,3,"滑雪","黑色","157cm",19),
		             (10,3,"滑雪","蓝色","157cm",34),
		             (10,3,"滑雪","红色","157cm",60),
		             (10,3,"滑雪","黄青","157cm",49),/*100*/
		             (10,4,"滑雪","黑色","148cm",78),
		             (10,4,"滑雪","蓝色","148cm",25),
		             (10,4,"滑雪","红色","148cm",67),
		             (10,4,"滑雪","黄青","148cm",39),
		             (10,4,"滑雪","黑色","152cm",18),
		             (10,4,"滑雪","蓝色","152cm",25),
		             (10,4,"滑雪","红色","152cm",67),
		             (10,4,"滑雪","黄青","152cm",30),
		             (10,4,"滑雪","黑色","157cm",19),
		             (10,4,"滑雪","蓝色","157cm",34),
		             (10,4,"滑雪","红色","157cm",60),
		             (10,4,"滑雪","黄青","157cm",49),
		             (10,5,"滑雪","黑色","148cm",78),
		             (10,5,"滑雪","蓝色","148cm",25),
		             (10,5,"滑雪","红色","148cm",67),
		             (10,5,"滑雪","黄青","148cm",39),
		             (10,5,"滑雪","黑色","152cm",18),
		             (10,5,"滑雪","蓝色","152cm",25),
		             (10,5,"滑雪","红色","152cm",67),
		             (10,5,"滑雪","黄青","152cm",30),
		             (10,5,"滑雪","黑色","157cm",19),
		             (10,5,"滑雪","蓝色","157cm",34),
		             (10,5,"滑雪","红色","157cm",60),
		             (10,5,"滑雪","黄青","157cm",49),
		             (10,6,"滑雪","黑色","148cm",78),
		             (10,6,"滑雪","蓝色","148cm",25),
		             (10,6,"滑雪","红色","148cm",67),
		             (10,6,"滑雪","黄青","148cm",39),
		             (10,6,"滑雪","黑色","152cm",18),
		             (10,6,"滑雪","蓝色","152cm",25),
		             (10,6,"滑雪","红色","152cm",67),
		             (10,6,"滑雪","黄青","152cm",30),
		             (10,6,"滑雪","黑色","157cm",19),
		             (10,6,"滑雪","蓝色","157cm",34),
		             (10,6,"滑雪","红色","157cm",60),
		             (10,6,"滑雪","黄青","157cm",49),
		             (10,7,"滑雪","黑色","148cm",78),
		             (10,7,"滑雪","蓝色","148cm",25),
		             (10,7,"滑雪","红色","148cm",67),
		             (10,7,"滑雪","黄青","148cm",39),
		             (10,7,"滑雪","黑色","152cm",18),
		             (10,7,"滑雪","蓝色","152cm",25),
		             (10,7,"滑雪","红色","152cm",67),
		             (10,7,"滑雪","黄青","152cm",30),
		             (10,7,"滑雪","黑色","157cm",19),
		             (10,7,"滑雪","蓝色","157cm",34),
		             (10,7,"滑雪","红色","157cm",60),
		             (10,7,"滑雪","黄青","157cm",49),
		             (11,1,"高山跑步","黑橘色","均码",46),
		             (11,2,"高山跑步","黄色","均码",98),
		             (11,3,"高山跑步","花色","均码",18),
		             (11,4,"高山跑步","土蓝","均码",3),
		             (11,5,"高山跑步","红色","均码",47),
		             (11,6,"高山跑步","灰色","均码",15),
		             (12,1,"滑雪","黑色","均码",23),
		             (12,2,"滑雪","黑红","均码",78),
		             (12,3,"滑雪","白色","均码",34),
		             (12,4,"滑雪","黑色","均码",19),
		             (12,5,"登山","黑橘色","均码",23),
		             (12,5,"登山","蓝色","均码",45),
		             (12,5,"登山","黑绿色","均码",30),
		             (12,5,"登山","绿色","均码",67),
		             (12,5,"登山","红色","均码",36),
		             (12,6,"登山","深灰色","均码",30),
		             (12,6,"登山","黑色","均码",67),
		             (12,6,"登山","白色","均码",36),
		             (13,1,"滑雪","黑色","均码",17),
		             (13,2,"滑雪","红色","均码",56),/*71*/
		             (13,3,"滑雪","深咖色框+茶色片","均码",56),
		             (13,3,"滑雪","无框茶色镜片","均码",17),
		             (13,3,"滑雪","枪色框+茶色片","均码",56),
		             (13,4,"滑雪","黑镜框+灰色镜片","均码",17),
		             (13,4,"滑雪","黑镜框+桔红镜片","均码",56),
		             (14,1,"攀岩","红色","30m",34),
		             (14,1,"攀岩","桔色","30m",19),
		             (14,1,"攀岩","黑色","30m",23),
		             (14,1,"攀岩","蓝色","30m",40);
		             

/*==========商品图片表--goodsImages--衣服===================*/
/*====徒步旅行===*/
INSERT INTO goodsimages

(goodsKindId,goodsId,exerciseName,src1,src2,src3,src4) VALUES
(1,1,"滑雪","../images/snow/snow_t1.png","../images/snow/snow_t2.png","../images/snow/snow_t3.png","../images/snow/snow_t4.png"),
(1,2,"滑雪","../images/snow/snow_f4.png","../images/snow/snow_t2.png","../images/snow/snow_t3.png","../images/snow/snow_t1.png"),
(1,3,"攀岩","../images/rockClimbing/2.png","../images/rockClimbing/7.png","../imagesrockClimbing/8.png","../images/rockClimbing/9.png"),
(1,4,"攀岩","../images/rockClimbing/23.png","../images/rockClimbing/28.png","../images/rockClimbing/29.png","../images/rockClimbing/291.png"),
(2,1,"徒步旅行","../images/onFoot/t1-1.png","../images/onFoot/t1-2.png","../images/onFoot/t1-3.png","../images/onFoot/t1-4.png"),
(2,2,"徒步旅行","../images/onFoot/t2-1.png","../images/onFoot/t2-2.png","../images/onFoot/t2-3.png","../images/onFoot/t2-4.png"),
(2,3,"徒步旅行","../images/onFoot/t3-3.png","../images/onFoot/t3-4.png","../images/onFoot/t3-7.png","../images/onFoot/t3-8.png"),
(2,4,"徒步旅行","../images/onFoot/t4-1.png","../images/onFoot/t4-2.png","../images/onFoot/t4-3.png","../images/onFoot/t4-4.png"),
(3,1,"徒步旅行","../images/onFoot/c1-3.png","../images/onFoot/c1-4.png","../images/onFoot/c1-8.png","../images/onFoot/c1-9.png"),
(3,2,"徒步旅行","../images/onFoot/c2-6.png","../images/onFoot/c2-9.png","../images/onFoot/c2-11.png","../images/onFoot/c2-14.png"),
(3,3,"徒步旅行","../images/onFoot/c3-4.png","../images/onFoot/c3-5.png","../images/onFoot/c3-6.png","../images/onFoot/c3-7.png"),
(3,4,"徒步旅行","../images/onFoot/c4-6.png","../images/onFoot/c4-9.png","../images/onFoot/c4-11.png","../images/onFoot/c4-12.png");

INSERT INTO goodsimages VALUES
(3,5,"滑雪","../images/snow/snow_f1.png","../images/snow/snow_f2.png","../images/snow/snow_f3.png","../images/snow/snow_f4.png","../images/snow/xin1.jpg","../images/snow/xin2.jpg","../images/snow/xin3.jpg","../images/snow/xin4.jpg");

INSERT INTO goodsimages(goodsKindId,goodsId,exerciseName,src1,src2,src3,src4) VALUES(3,6,"滑雪","../images/snow/snow_f5.png","../images/snow/snow_f6.png","../images/snow/snow_f5.png","../images/snow/snow_f6.png"),
(3,7,"滑雪","../images/snow/snow_f7.png","../images/snow/snow_f8.png","../images/snow/snow_f7.png","../images/snow/snow_f8.png"),
(3,8,"滑雪","../images/snow/snow_f9.png","../images/snow/snow_f10.png","../images/snow/snow_f9.png","../images/snow/snow_f10.png"),
(3,9,"高山跑步","../images/run/yDongFu/1.png","../images/run/yDongFu/1.png","../images/run/yDongFu/1.png","../images/run/yDongFu/1.png"),
(3,10,"高山跑步","../images/run/yDongFu/2.png","../images/run/yDongFu/2.png","../images/run/yDongFu/2.png","../images/run/yDongFu/2.png"),
(3,11,"高山跑步","../images/run/yDongFu/3.png","../images/run/yDongFu/3.png","../images/run/yDongFu/3.png","../images/run/yDongFu/3.png"),
(3,12,"高山跑步","../images/run/yDongFu/4.png","../images/run/yDongFu/4.png","../images/run/yDongFu/4.png","../images/run/yDongFu/4.png"),
(4,1,"滑雪","../images/snow/snow_x1.png","../images/snow/snow_x2.png","../images/snow/snow_x3.png","../images/snow/snow_x4.png"),
(4,2,"滑雪","../images/snow/snow_x1.png","../images/snow/snow_x2.png","../images/snow/snow_x3.png","../images/snow/snow_x4.png"),
(4,3,"滑雪","../images/snow/snow_x2.png","../images/snow/snow_x3.png","../images/snow/snow_x4.png","../images/snow/snow_x5.png"),
(4,4,"滑雪","../images/snow/snow_x2.png","../images/snow/snow_x3.png","../images/snow/snow_x4.png","../images/snow/snow_x5.png"),
(4,5,"滑雪","../images/snow/snow_x3.png","../images/snow/snow_x4.png","../images/snow/snow_x5.png","../images/snow/snow_x6.png"),
(4,6,"滑雪","../images/snow/snow_x3.png","../images/snow/snow_x4.png","../images/snow/snow_x5.png","../images/snow/snow_x6.png"),
(4,7,"攀岩","../images/rockClimbing/shoes/601.png","../images/rockClimbing/shoes/602.png","../images/rockClimbing/shoes/603.png","../images/rockClimbing/shoes/604.png"),
(4,8,"攀岩","../images/rockClimbing/shoes/606.png","../images/rockClimbing/shoes/607.png","../images/rockClimbing/shoes/608.png","../images/rockClimbing/shoes/609.png"),
(4,9,"攀岩","../images/rockClimbing/shoes/612.png","../images/rockClimbing/shoes/613.png","../images/rockClimbing/shoes/614.png","../images/rockClimbing/shoes/615.png"),
(4,10,"登山","../images/dShan/dShanXie/pic1/1.png","../images/dShan/dShanXie/pic1/3.png","../images/dShan/dShanXie/pic1/5.png","../images/dShan/dShanXie/pic1/6.png"),
(4,11,"登山","../images/dShan/dShanXie/pic2/1.png","../images/dShan/dShanXie/pic2/2.png","../images/dShan/dShanXie/pic2/4.png","../images/dShan/dShanXie/pic2/6.png"),
(5,1,"登山","../images/dShan/dShanZhang/pic1/1.png","../images/dShan/dShanZhang/pic1/6.png","../images/dShan/dShanZhang/pic1/2.png","../images/dShan/dShanZhang/pic1/3.png"),
(5,2,"登山","../images/dShan/dShanZhang/pic2/5.png","../images/dShan/dShanZhang/pic2/1.png","../images/dShan/dShanZhang/pic2/4.png","../images/dShan/dShanZhang/pic2/3.png"),
(6,1,"徒步旅行","../images/onFoot/knapsacks/5.png","../images/onFoot/knapsacks/3.png","../images/onFoot/knapsacks/2.png","../images/onFoot/knapsacks/4.png"),
(6,2,"徒步旅行","../images/onFoot/knapsacks/k2-1.jpg","../images/onFoot/knapsacks/k2-2.jpg","../images/onFoot/knapsacks/k2-3.jpg","../images/onFoot/knapsacks/k24.jpg"),
(6,3,"高山跑步","../images/run/yBao/1.png","../images/run/yBao/2.png","../images/run/yBao/3.png","../images/run/yBao/4.png"),
(6,4,"高山跑步","../images/run/yBao/2.png","../images/run/yBao/3.png","../images/run/yBao/4.png","../images/run/yBao/5.png"),
(6,5,"高山跑步","../images/run/yBao/3.png","../images/run/yBao/4.png","../images/run/yBao/5.png","../images/run/yBao/6.png"),
(6,6,"高山跑步","../images/run/yBao/1.png","../images/run/yBao/2.png","../images/run/yBao/3.png","../images/run/yBao/4.png"),
(6,7,"登山","../images/dShan/dShanBao/pic1/1.png","../images/dShan/dShanBao/pic1/2.png","../images/dShan/dShanBao/pic1/3.png","../images/dShan/dShanBao/pic1/4.png"),
(6,8,"登山","../images/dShan/dShanBao/pic1/3.png","../images/dShan/dShanBao/pic1/4.png","../images/dShan/dShanBao/pic1/5.png","../images/dShan/dShanBao/pic1/6.png"),
(7,1,"攀岩","../images/rockClimbing/safetyStrap/501.png","../images/rockClimbing/safetyStrap/503.png","../images/rockClimbing/safetyStrap/504.png","../images/rockClimbing/safetyStrap/505.png"),
(8,1,"攀岩","../images/rockClimbing/safetyLock/301.png","../images/rockClimbing/safetyLock/304.png","../images/rockClimbing/safetyLock/307.png","../images/rockClimbing/safetyLock/308.png"),
(8,2,"攀岩","../images/rockClimbing/safetyLock/images/309.png","../images/rockClimbing/safetyLock/images/310.png","../images/rockClimbing/safetyLock/images/311.png","../images/rockClimbing/safetyLock/images/312.png"),
(9,1,"徒步旅行","../images/onFoot/hats/4.png","../images/onFoot/hats/5.png","../images/onFoot/hats/6.png","../images/onFoot/hats/7.png"),
(9,2,"徒步旅行","../images/onFoot/hats/1.png","../images/onFoot/hats/2.png","../images/onFoot/hats/3.png","../images/onFoot/hats/4.png"),
(10,1,"滑雪","../images/snow/snow_b1.png","../images/snow/snow_b2.png","../images/snow/snow_b3.png","../images/snow/snow_b4.png"),
(10,2,"滑雪","../images/snow/snow_b2.png","../images/snow/snow_b3.png","../images/snow/snow_b4.png","../images/snow/snow_d1.png"),
(10,3,"滑雪","../images/snow/snow_b3.png","../images/snow/snow_b4.png","../images/snow/snow_d1.png","../images/snow/snow_d2.png"),
(10,4,"滑雪","../images/snow/snow_b4.png","../images/snow/snow_d1.png","../images/snow/snow_d2.png","../images/snow/snow_d3.png"),
(10,5,"滑雪","../images/snow/snow_d1.png","../images/snow/snow_d2.png","../images/snow/snow_d3.png","../images/snow/snow_b1.png"),
(10,6,"滑雪","../images/snow/snow_d2.png","../images/snow/snow_d3.png","../images/snow/snow_b1.png","../images/snow/snow_b2.png"),
(11,1,"高山跑步","../images/run/fDai/1.png","../images/run/fDai/2.png","../images/run/fDai/3.png","../images/run/fDai/3.png"),
(11,2,"高山跑步","../images/run/fDai/2.png","../images/run/fDai/2.png","../images/run/fDai/3.png","../images/run/fDai/3.png"),
(11,3,"高山跑步","../images/run/fDai/3.png","../images/run/fDai/2.png","../images/run/fDa/3.png","../images/run/fDai/3.png"),
(11,4,"高山跑步","../images/run/fDai/4.png","../images/run/fDai/2.png","../images/run/fDai/3.png","../images/run/fDai/3.png"),
(11,5,"高山跑步","../images/run/fDai/5.png","../images/run/fDai/2.png","../images/run/fDai/3.png","../images/run/fDai/3.png"),
(11,6,"高山跑步","../images/run/fDai/6.png","../images/run/fDai/2.png","../images/run/fDai/3.png","../images/run/fDai/3.png"),
(12,1,"滑雪","../images/snow/snow_s1.png","../images/snow/snow_s2.png","../images/snow/snow_s3.png","../images/snow/snow_s4.png"),
(12,2,"滑雪","../images/snow/snow_s4.png","../images/snow/snow_s3.png","../images/snow/snow_s2.png","../images/snow/snow_s1.png"),
(12,3,"登山","../images/dShan/sTao/pic1/1.png","../images/dShan/sTao/pic1/2.png","../images/dShan/sTao/pic1/3.png","../images/dShan/sTao/pic1/4.png"),
(12,4,"登山","../images/dShan/sTao/pic2/5.png","../images/dShan/sTao/pic1/6.png","../images/dShan/sTao/pic1/7.png","../images/dShan/sTao/pic1/8.png"),
(13,1,"滑雪","../images/snow/snow_y1.png","../images/snow/snow_y2.png","../images/snow/snow_y4.png","../images/snow/snow_y6.png"),
(13,2,"滑雪","../images/snow/snow_y11.png","../images/snow/snow_y12.png","../images/snow/snow_y7.png","../images/snow/snow_y3.png"),
(13,3,"登山","../images/dShan/yJing/pic1/1.png","../images/dShan/yJing/pic1/2.png","../images/dShan/yJing/pic1/3.png","../images/dShan/yJing/pic1/5.png"),
(13,4,"登山","../images/dShan/yJing/pic2/1.png","../images/dShan/yJing/pic2/2.png","../images/dShan/yJing/pic2/4.png","../images/dShan/yJing/pic2/5.png"),
(14,1,"攀岩","../images/rockClimbing/string/401.jpg","../images/rockClimbing/string/402.jpg","../images/rockClimbing/string/403.jpg","../images/rockClimbing/string/404.jpg");

/*===========================用户注册信息  

userregist============================================*/
INSERT INTO userregist VALUES
(NULL,"付记丰","1755861911@qq.com","123456","13845907891"),
(NULL,"张华","2778477912@qq.com","123456","17729825144"),
(NULL,"李斯","8719376497@qq.com","123456","13887260187"),
(NULL,"王宏","19247838@qq.com","123456","1876514220"),
(NULL,"钱芊芊","87165423@qq.com","123456","19117890198"),
(NULL,"郭襄","18269237@qq.com","123456","18128617651"),
(NULL,"林杉","456371980@qq.com","123456","13910073241"),
(NULL,"张昊鸧","887296637@qq.com","123456","13945879101"),
(NULL,"周丽丝","770188917@qq.com","123456","14765142933"),
(NULL,"秦苦艾","87165423@qq.com","123456","19118165667"),
(NULL,"艾青","18269237@qq.com","123456","18182766512"),
(NULL,"陶韬","456371980@qq.com","123456","13941987766");


/*===========================用户地址  

address==================================*/
INSERT INTO userAddress VALUES
(1,"四川省成都市武侯区云华路333号","付记丰","13845907891"),
(1,"四川省简阳市人民政府","付记扁","17729854133"),
(2,"山东省潍坊机场路333号","张华","18277821776"),
(3,"四川省成都市武侯区大院北一街25号院","张媛媛","18125541765"),
(3,"江苏省杭州市萧山大江东经济区87号","李斯","17829931665"),
(4,"黑龙江哈尔冰冰雪大世界","王宏","13845907891"),
(5,"西藏自治区拉萨市布达拉宫步行街","钱芊芊","19117890198"),
(6,"山东省济南市市中区南辛庄西路336号","郭襄","19117890198"),
(7,"四川省都江堰东软学院","林杉","18128617651"),
(8,"重庆市渝北区两路镇机场路1号","张昊鸧","13945879101"),
(9,"甘肃省张掖市甘州区人民路32号","周丽丝","14765142933"),
(10,"新疆维吾尔族自治区昌平市华天路88号","秦苦艾","19118165667"),
(11,"山东省济南天桥区济泺路87号","艾青","18182766512"),
(12,"郑州市中牟县郑开大道87号","陶韬","13941987766");


/*===========================默认地址 defaultaddress================*/
INSERT INTO defaultaddress VALUES(1,"四川省武侯区云华路333号","付记丰","13845907891");

/*===========================用户购物车  shoppingcar===================
INSERT INTO shoppingCar VALUES(1,1,1,"../images/snow/snow_t1.png","防护头盔","M","白色",200.00,1);
*/

/*===========================用户收藏  usercollect====================
INSERT INTO usercollect VALUES(1,3,5);
*/


/*============================博客  

bloginformation===================================*/
INSERT INTO blogInformation VALUES(NULL,"../images/Blog/6.jpg","生活在登山靴中更好","只要你为目的地穿着合适的双靴，生活在登山靴方面确实更好。了解更多关于SCARPA背包，徒步旅行和轻便鞋之间差异的信息，以及最适合您的鞋子","2018-02-01","抱石 攀岩 攀岩"),
(NULL,"../images/Blog/7.jpg","ALANNAH YIP继续实现","专业攀岩者，Alannah Yip，有很多奖牌可以炫耀她的运动能力，但现在她也有一份证明她更多的文凭","2018-02-01","运动 攀岩 攀岩"),
(NULL,"../images/Blog/8.jpg","提升登山者","Poleway攀岩运动员Rob Pizem在教孩子如何攀爬时打破了他如何保持学习乐趣的策略",
"2018-02-01","运动员 攀岩 攀岩"),
(NULL,"../images/Blog/9.jpg","高山跑步击败了热火","随着日子变得越来越热，跑步越来越难。高山跑步可以提供更凉爽的温度和阴影小径，有助于缓解夏季对锻炼的影响。但是，如果你是这项运动的新手，找到合适的步道鞋可能是一项艰巨的任务。","2018-02-01","高山跑步 跑步 跑步 跑步鞋"),
(NULL,"../images/Blog/10.jpg","介绍MAESTRO MID","Poleway很高兴能够发布他们的第一款中高档鞋，这绝不是传统的。Maestro Mid攀岩鞋在今年春天推出，经过了我们忠实的传统攀岩客户的期待。","2018-02-01","攀岩鞋 攀岩 传统攀岩"),
(NULL,"../images/Blog/11.jpg","我们推出了它！","Poleway推出了一个创新的新网站，传达了品牌的现代状态，并将在未来几年内提升客户的体验。","2018-02-01","新闻"),
(NULL,"../images/Blog/12.jpg","多运动心理韧性","保持健康的视角，了解您一直在做的培训类型，如何转移到其他活动，以及您在每项运动中的健康状况，这对于避免倦怠至关重要","2018-02-01","高山运行 乔·格兰特 跑 越野跑"),
(NULL,"../images/Blog/13.jpg","Poleway运动员获得最前沿奖","2017年6月3日，美国阿尔卑斯山俱乐部为他们首次登上Kala West的西南山脊，在喀喇昆仑山脉的一个海拔7,040米（23,097英尺）的山峰上颁发了2017年度最佳边缘奖。","2018-02-01","准入基金 高山登山 登山 攀登"),
(NULL,"../images/Blog/14.jpg","攀岩瑜伽","如果你在攀爬过程中遇到特定的灵活区域（或者因为攀爬而不断收紧肌肉），你可能会发现瑜伽可以解决这个问题","2/1/18","ally rainey 攀岩 攀岩 瑜伽"),
(NULL,"../images/Blog/15.jpg","南非攀登和揭露","如果您曾经考虑过攀登南非之旅，那么毫无疑问，您正在为传说中的罗克兰（Rocklands），风景秀丽的桌山（Table Mountain）或迷人的瀑布博文（Waterfall Boven）而努力","2018-02-01","攀登 保罗mcsorley 攀岩 南非"),
(NULL,"../images/Blog/16.jpg","建筑锚和放置齿轮; 如何做对。","什么是擅长建造锚和摆放装备的最佳方法？","2018-02-01","攀登"),
(NULL,"../images/Blog/17.jpg","徒步旅行，跑步和接近 - 我穿什么鞋？","您所穿鞋类的类型可能是被低估的决定。胎面尺寸，橡胶类型，缓冲和支撑均可对性能产生重大影响。我们在这里帮助您破解穿什么鞋的时间和原因","2018-02-01","高山运动 加息 跑 越野跑"),
(NULL,"../images/Blog/18.jpg","准入基金年度峰会 - 细目","Access Fund年度峰会由Sharp End Award获奖者自己打破了！","2018-02-01","进入基金 攀岩 攀岩"),
(NULL,"../images/Blog/19.jpg","奔跑前的平静 - 黎明巡逻","近5000英尺爬上山。密苏里州迎面而来，在山上度过壮观的一天的兴奋开始建立起来。现在是时候跑步了。","2018-02-01","黎明巡逻 乔·格兰特 运行 TRA"),
(NULL,"../images/Blog/20.jpg","古巴自由，登山者的天堂","对于登山者来说，古巴是一个隐藏的天堂。很容易到达这里，你不需要偷偷靠近守卫去到峭壁，人们很友好哦，是的，攀登是一流的！","2018-02-01","攀登 古巴 攀岩 旅行"),
(NULL,"../images/Blog/21.jpg","跑去感受活力","“为什么我这样做？”为什么我决定训练我在同一年学习如何成为父母的同一年中最难的训练？","2018-02-01","跑"),
(NULL,"../images/Blog/22.jpg","夏季摇滚鞋护理","过度的热量会破坏摇滚鞋。这是夏天如何照顾你的摇滚鞋。","2018-02-01","如何"),
(NULL,"../images/Blog/23.jpg","越野跑：如何准备大日子","所以你想在今年解决一场大赛或长期目标。以下是您准备如何做好准备的方法","2018-02-02","如何 乔授予"),
(NULL,"../images/Blog/24.jpg","七个春天的碎片不是印第安溪","是的，The Creek是rad，但今年春天你应该扩展到其他一些令人敬畏的早期季节目的地.","2018-02-03","新闻"),
(NULL,"../images/Blog/25.jpg","如何测试你的舒适区","Lynsey Dyer一直想学习滑雪登山。但她从来没有真正有机会。到现在","2018-02-03",""),
(NULL,"../images/Blog/26.jpg","ALEX PUCCIO：复出女王","首先是膝盖受伤，然后是颈部受伤，现在Alex Puccio赢得了她参加的所有比赛","2018-02-04","alex puccio 本能vs 新闻"),
(NULL,"../images/Blog/27.jpg","SCARPA PHANTOM TECH：无与伦比的性能","现在，Phantom Tech比以往更轻，更温暖，更硬，是迄今为止我们最先进的垂直冰靴。","2018-02-04","幻影科技 视频"),
(NULL,"../images/Blog/28.jpg","早季冰上攀登的5个技巧","一年中的这个时间不仅仅是发送。重要的是每天都要有思想，关心，并有机会调整赛季中期的目标。","2018-02-05","莎拉·胡尼肯 怎么 模样"),
(NULL,"../images/Blog/29.jpg","德莱尼米勒的五个问题","Delaney Miller加入SCARPA运动队。我们问她几个关于新伙伴关系和她的攀登愿望的问题。","2018-02-06","助推器的 德拉尼米勒 新闻"),
(NULL,"../images/Blog/30.jpg","新SCARPA F1：轻盈，快速，强大","SCARPA F1融合了轻便的可操作性和下坡动力，为频繁的野外滑雪者创造了令人敬畏的日常驾驶员。","2018-02-07","f1 视频"),
(NULL,"../images/Blog/31.jpg","2016年最佳滑雪靴","SCARPA滑雪靴在2016/17冬季获得众多杂志奖。","2018-02-08","f1 自由 新闻"),
(NULL,"../images/Blog/32.jpg","优胜美地学校：“我什么都不知道”","对于一位英国SCARPA运动员来说，前往优胜美地的旅行教会了最终的教训，即谦逊。","2018-02-09","新闻 罗比菲利普斯"),
(NULL,"../images/Blog/33.jpg","SCARPA德拉戈已经到了！","另一位由着名摇滚鞋设计师Heinz Mariacher设计的杰作，SCARPA Drago是面向目标的登山者的终极鞋。","2018-0210","drago sean mccoll 视频"),
(NULL,"../images/Blog/34.jpg","我们的8个最喜欢的夏季登山攀岩","由于潮湿和光滑的岩石，夏天的狗日可以拖累严重的发送。但这是阿尔卑斯山或一些醇香的克拉金和雨伞饮料的好时机","2018-02-11","新闻 山姆伊莱亚斯 将加入"),
(NULL,"../images/Blog/35.jpg","如何建立一个传统攀爬架","SCARPA运动员Shingo Ohkawa解开他的包，揭示他黑暗交易的工具：Trad Climbing。",
"2018-02-12","如何 shingo ohkawa 蒸气花边"),
(NULL,"../images/Blog/36.jpg","阿尔卑斯风格的珠穆朗玛峰：处理早期归乡","SCARPA运动员拉斐尔·斯拉温斯基（Raphael Slawinski）在珠穆朗玛峰探险队被一场毁灭性地震缩短后返回家园。可以理解，处理起来并不容易。","2018-02-13","新闻 raphael slawinski");


/*============================活动  

activityinformation===============================*/
INSERT INTO activityInformation VALUES(NULL,"云南省迪庆藏族自治州中甸县，海拔5396米，迪庆哈巴雪山，300人大型户外活动","云南省迪庆藏族自治州中甸县","2018-11-14 23:30",0,"../images/activity/moutain.jpg","../activityQuanjingtu/index.html"
),
(NULL,"尼泊尔,安纳布尔纳大环线——徒步爱好者的朝圣之路(世界十大徒步路线榜首),全程约300公里","尼泊尔,安纳布尔纳大环线","2018-11-8 23:30",300,"../images/activity/bike.png","../activityQuanjingtu/index-1.html"),
(NULL,"念青唐古拉峰是一座银装素裹的雄峰,中国青藏高原主要山脉之一，海拔7111米","念青唐古拉峰","2018-11-2 23:30",200,"../images/activity/ski.jpg","../activityQuanjingtu/index-2.html");


/*====================管理员=========================*/
INSERT INTO administrator VALUES
(NULL,"123456","吕嫣","17729810877",1,1),
(NULL,"123456","付记丰","17729921455",2,1),
(NULL,"123456","郑雪","18129816621",2,1),
(NULL,"123456","黄嘉奇","10987265411",2,1),
(NULL,"123456","匡良梦","13829876534",2,1),
(NULL,"123456","李明建","13902113434",2,1),
(NULL,"123456","舒浩东","11890231767",2,1);


/*=====================permissions  管理员权限===========================*/
INSERT INTO permissions VALUES(1,"产品上下架"),
                              (1,"订单查看"),
                              (1,"客户信息查看"),
                              (1,"博客发布"),
                              (1,"博客查看"),
                              (1,"博客删除"),
                              (1,"博客修改"),
                              (1,"活动发布"),
                              (1,"活动查看"),
                              (1,"活动删除"),
                              (1,"活动修改"),
                              (2,"产品上下架"),
                              (2,"产品信息修改"),
                              (2,"产品信息查看"),
                              (3,"产品上下架"),
                              (3,"产品信息修改"),
                              (3,"产品信息查看"),
                              (4,"订单查看"),
                              (4,"订单取消"),
                              (5,"客户信息查看"),
                              (6,"博客发布"),
                              (6,"博客查看"),
                              (6,"博客删除"),
                              (6,"博客修改"),
                              (7,"活动发布"),
                              (7,"活动查看"),
                              (7,"活动删除"),
                              (7,"活动修改");


/*=========================用户订单表===================================*/
INSERT INTO userorder VALUES
(NULL,"201811120913",1,5,3,"../images/snow/snow_f1.png","女士MOVE拉链衫","S","白色",200.00,1,20181112,20181120,"四川省成都市武侯区云华路333号",1,1,1),
(NULL,"201811120913",1,1,1,"../images/snow/snow_t1.png","防护头盔","M","白色",899.00,1,20181112,20181120,"四川省成都市武侯区云华路333号",1,1,1),
(NULL,"201812121313",2,9,1,"../images/onFoot/hats/4.png","极道NF00A5WG帽","均码","黑色",298.00,1,20181212,20181220,"山东省潍坊机场路333号",1,1,0),
(NULL,"201812121313",3,5,1,"../images/dShan/dShanZhang/pic1/1.png","骆驼户外登山杖","80.0cm","黄色",68.00,1,20181212,20181220,"江苏省杭州市萧山大江东经济区87号",1,0,0),
(NULL,"201812130956",5,10,6,"../images/snow/snow_d2.png","男子滑雪板双板 全地形板","148cm","黑色",4788.00,1,20181213,20181221,"西藏自治区拉萨市布达拉宫步行街",0,0,0),
(NULL,"201805112023",6,4,1,"../images/snow/snow_x1.png","F1鞋","37","黑橘色",1788.00,1,20180511,20180519,"山东省济南市市中区南辛庄西路336号",1,1,1),
(NULL,"201805112023",9,4,1,"../images/snow/snow_x1.png","F1鞋","37","黑橘色",1788.00,1,20180511,20180519,"甘肃省张掖市甘州区人民路32号",1,1,1),
(NULL,"201812121313",12,4,1,"../images/snow/snow_x1.png","F1鞋","37","黑橘色",1788.00,1,20181212,20181220,"郑州市中牟县郑开大道87号",1,1,1);


/*============================退货表  

returnorder==========================================*/
INSERT INTO returnOrder VALUES(2,"201811120913",1,1,1,1),
(6,"201805112023",5,1,4,2),
(8,"201812121313",12,1,4,3),
(4,"201812121313",3,1,5,4);

/*============================换货表  

changeorder==========================================*/
INSERT INTO changeOrder VALUES(1,"201811120913",1,3,5,1),
(7,"201805112023",6,1,4,4);
